Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory
The Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory class supports the creation of the UI controls based on the data from the Tekla.BIM.DirectManipulation.Services.Controls.ControlBase.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.#ctor(System.EventHandler,System.EventHandler,System.EventHandler,System.EventHandler,System.EventHandler)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory class.
onItemClicked: The method handling the click event for any of the returned items.
onItemHovered: The method handling the hover event for any of the returned items.
onItemStateChange: The method handling the change event for any of the returned items.
onGotKeyboardFocus: The method handling when item got keyboard focus.
onLostKeyboardFocus: The method handling when item lost keyboard focus.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateItems(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Creates a collection of the UI controls for the given Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup.
controlsGroup: The group to wrap with instances of the UI controls.
Returns: A new collection of the UI controls wrapping the controlsGroup parameter.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.Create(Tekla.BIM.DirectManipulation.Services.Controls.IControl)
Creates the System.Windows.FrameworkElement instances representing the given Tekla.BIM.DirectManipulation.Services.Controls.ControlBase and attach the event handlers.
controlData: The object to create the System.Windows.FrameworkElement instances for.
Returns: The new System.Windows.FrameworkElement instances representing the controlData parameter.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateItems(Tekla.BIM.DirectManipulation.Services.Controls.IControl)
Creates the System.Windows.FrameworkElement instances representing the given Tekla.BIM.DirectManipulation.Services.Controls.ControlBase.
controlData: The object to create the System.Windows.FrameworkElement instances for.
Returns: The new System.Windows.FrameworkElement instances representing the controlData parameter.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateButton(Tekla.BIM.DirectManipulation.Services.Controls.ButtonControl)
Initializes a default System.Windows.Controls.Button instance with the given data.
controlData: The control data.
Returns: A collection with only one item, the initialized System.Windows.Controls.Button.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateToggleButton(Tekla.BIM.DirectManipulation.Services.Controls.ToggleButtonControl)
Initializes a default System.Windows.Controls.Primitives.ToggleButton instance with the given data.
controlData: The control data.
Returns: A collection with only one item, the initialized System.Windows.Controls.Primitives.ToggleButton.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateUpDownButton(Tekla.BIM.DirectManipulation.Services.Controls.UpDownButtonControl)
Initializes a default Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.UpDownButton instance with the given data.
controlData: The control data.
Returns: A collection with only one item, the initialized Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.UpDownButton.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateTextBox(Tekla.BIM.DirectManipulation.Services.Controls.TextBoxControl)
Initializes a default System.Windows.Controls.TextBox instance with the given data.
controlData: The control data.
Returns: The initialized controls.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateLabel(Tekla.BIM.DirectManipulation.Services.Controls.LabelControl)
Initializes a default Tekla.BIM.DirectManipulation.Services.Controls.LabelControl with the given data.
controlData: The control data.
Returns: The initialized controls.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateValueBox(Tekla.BIM.DirectManipulation.Services.Controls.ValueBoxControl)
Initializes a default System.Windows.Controls.Label and a default System.Windows.Controls.TextBox instance with the given data.
controlData: The control data.
Returns: The initialized controls.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateNullableValueBox(Tekla.BIM.DirectManipulation.Services.Controls.NullableValueBoxControl)
Initializes a default System.Windows.Controls.Label and a default System.Windows.Controls.TextBox instance with the given data.
controlData: The control data.
Returns: The initialized controls.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateMultiValueBox(Tekla.BIM.DirectManipulation.Services.Controls.MultiValueBoxControl)
Initializes a default System.Windows.Controls.Label and a default System.Windows.Controls.TextBox instance with the given data.
controlData: The control data.
Returns: The initialized controls.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateDropDown(Tekla.BIM.DirectManipulation.Services.Controls.DropDownListControl)
Initializes a default System.Windows.Controls.Label and a default System.Windows.Controls.ComboBox instance with the given data.
controlData: The control data.
Returns: The initialized controls.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreatePanel(Tekla.BIM.DirectManipulation.Services.Controls.PanelControl)
Initializes a default System.Windows.Controls.Panel instance with the given data.
controlData: The control data.
Returns: The initialized controls.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.CreateExpander(Tekla.BIM.DirectManipulation.Services.Controls.ControlExpander)
Initializes a default System.Windows.Controls.Panel instance with the given data.
controlData: The control data.
Returns: The initialized control.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlFactory.OnNullableValueBoxControlStateChanged(System.Object,System.Windows.RoutedEventArgs)
Called when the nullable value box control state changed.
sender: The sender.
routedEventArgs: The System.Windows.RoutedEventArgs instance containing the event data.